{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}C:/Users/SLee/Dropbox/Rainfall insurance India - Round 2/Data Analysis/logs/IN_rainfall_compile.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}28 Jan 2016, 15:05:07
{txt}
{com}. 
. /****************************************************************
>         SECTION 1: Import datasets
> ****************************************************************/
. 
. // Round 2
. use "${c -(}dta{c )-}/round2/IN_rainfall_r2_compiled.dta"
{txt}
{com}. isid a_1hhid
{txt}
{com}. save `round2dta'
{txt}file C:\Users\SLee\AppData\Local\Temp\ST_01000001.tmp saved

{com}. 
. // Round 3
. use "${c -(}dta{c )-}/round3/IN_rainfall_r3_cleaned.dta", clear
{txt}
{com}. isid a_1hhid
{txt}
{com}. save `round3dta'
{txt}file C:\Users\SLee\AppData\Local\Temp\ST_01000002.tmp saved

{com}. 
. // Intervention
. use "${c -(}dta{c )-}/intervention/IN_rainfall_intervention.dta", clear
{txt}
{com}. isid a_1hhid
{txt}
{com}. save `interventiondta'
{txt}file C:\Users\SLee\AppData\Local\Temp\ST_01000003.tmp saved

{com}. 
. /****************************************************************
>         SECTION 2: Merge datasets
> ****************************************************************/
. 
. use `round2dta', clear
{txt}
{com}. merge 1:1 a_1hhid using `round3dta', nogen assert(1 3) // To confirm that round3 sample is a subset of round2 sample
{res}{txt}(label occupation already defined)
(label yesno already defined)
(label relationship already defined)

{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}           2,758
{txt}{col 9}from master{col 30}{res}           2,758{txt}  
{col 9}from using{col 30}{res}               0{txt}  

{col 5}matched{col 30}{res}           2,797{txt}  
{col 5}{hline 41}

{com}. merge 1:1 a_1hhid using `interventiondta', nogen assert(2 3) // To confirm that round2 sample is a subset of intervention sample.
{res}{txt}(label phone already defined)

{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}              26
{txt}{col 9}from master{col 30}{res}               0{txt}  
{col 9}from using{col 30}{res}              26{txt}  

{col 5}matched{col 30}{res}           5,555{txt}  
{col 5}{hline 41}

{com}. 
. 
. /****************************************************************
>         SECTION 3: Save and Exit
> ****************************************************************/
. 
. compress
{txt}  (0 bytes saved)

{com}. save "${c -(}dta{c )-}/compiled/IN_rainfall_compiled.dta", replace
{txt}file C:/Users/SLee/Dropbox/Rainfall insurance India - Round 2/Data Analysis/output/datasets/compiled/IN_rainfall_compiled.dta saved

{com}. 
. cap file close _all
{txt}
{com}. cap log close
{smcl}
{com}{sf}{ul off}