{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}C:/Users/ftac2/Dropbox/Rainfall insurance India - Round 2/Data Analysis/build/logs/SectionJ1_Asset_part1_clean.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}26 Jun 2016, 02:12:06
{txt}
{com}. 
. 
. /****************************************************************
>         SECTION 1: Import Raw Data                                                                                                      
> ****************************************************************/
. 
. 
. // Master Data
. use "${c -(}builddta{c )-}/followup_2014/MasterData_cleaned.dta", clear
{txt}
{com}. 
. /// Keep ID and Section J1
> keep Id q910_ownasskha11_1-q921_1_areaunit_5
{txt}
{com}. order *, alphabetic
{txt}
{com}. order q921_1_area_4 q921_1_area_5 q921_1_areaunit_4 q921_1_areaunit_5, after(q921_totfamdaylabkha11_5)
{txt}
{com}. 
. /// Correct erros
> destring *, replace
{txt}Id contains nonnumeric bytes; no {res}replace
{txt}q910_ownasskha11_1 already numeric; no {res}replace
{txt}q910_ownasskha11_2 already numeric; no {res}replace
{txt}q910_ownasskha11_3 already numeric; no {res}replace
{txt}q910_ownasskha11_4 already numeric; no {res}replace
{txt}q910_ownasskha11_5 already numeric; no {res}replace
{txt}q911_totvalkha11_1 already numeric; no {res}replace
{txt}q911_totvalkha11_2 already numeric; no {res}replace
{txt}q911_totvalkha11_3 already numeric; no {res}replace
{txt}q912_totvalnow_1 already numeric; no {res}replace
{txt}q912_totvalnow_2 already numeric; no {res}replace
{txt}q912_totvalnow_3 already numeric; no {res}replace
{txt}q913_increntlast12mon_1 already numeric; no {res}replace
{txt}q913_increntlast12mon_2 already numeric; no {res}replace
{txt}q913_increntlast12mon_3 already numeric; no {res}replace
{txt}q913_increntlast12mon_4 already numeric; no {res}replace
{txt}q913_increntlast12mon_5 already numeric; no {res}replace
{txt}q914_YYcons_1 already numeric; no {res}replace
{txt}q914_YYcons_2 already numeric; no {res}replace
{txt}q914_YYcons_3 already numeric; no {res}replace
{txt}q915_constmatcost_1 contains nonnumeric bytes; no {res}replace
{txt}q915_constmatcost_2 already numeric; no {res}replace
{txt}q915_constmatcost_3 already numeric; no {res}replace
{txt}q915_constmatcost_4 already numeric; no {res}replace
{txt}q915_constmatcost_5 already numeric; no {res}replace
{txt}q916_constotwagpayhirelab_1 already numeric; no {res}replace
{txt}q916_constotwagpayhirelab_2 already numeric; no {res}replace
{txt}q916_constotwagpayhirelab_3 already numeric; no {res}replace
{txt}q916_constotwagpayhirelab_4 already numeric; no {res}replace
{txt}q916_constotwagpayhirelab_5 already numeric; no {res}replace
{txt}q917_constotfamday_1 contains nonnumeric bytes; no {res}replace
{txt}q917_constotfamday_2 already numeric; no {res}replace
{txt}q917_constotfamday_3 already numeric; no {res}replace
{txt}q917_constotfamday_4 already numeric; no {res}replace
{txt}q917_constotfamday_5 already numeric; no {res}replace
{txt}q918_mainsinkha11_1 already numeric; no {res}replace
{txt}q918_mainsinkha11_2 already numeric; no {res}replace
{txt}q918_mainsinkha11_3 already numeric; no {res}replace
{txt}q918_mainsinkha11_4 already numeric; no {res}replace
{txt}q918_mainsinkha11_5 already numeric; no {res}replace
{txt}q919_mainmatcoskha11_1 already numeric; no {res}replace
{txt}q919_mainmatcoskha11_2 already numeric; no {res}replace
{txt}q919_mainmatcoskha11_3 already numeric; no {res}replace
{txt}q919_mainmatcoskha11_4 already numeric; no {res}replace
{txt}q919_mainmatcoskha11_5 already numeric; no {res}replace
{txt}q920_totwagepayhirelabkha_1 already numeric; no {res}replace
{txt}q920_totwagepayhirelabkha_2 already numeric; no {res}replace
{txt}q920_totwagepayhirelabkha_3 already numeric; no {res}replace
{txt}q920_totwagepayhirelabkha_4 already numeric; no {res}replace
{txt}q920_totwagepayhirelabkha_5 already numeric; no {res}replace
{txt}q921_totfamdaylabkha11_1 already numeric; no {res}replace
{txt}q921_totfamdaylabkha11_2 already numeric; no {res}replace
{txt}q921_totfamdaylabkha11_3 already numeric; no {res}replace
{txt}q921_totfamdaylabkha11_4 already numeric; no {res}replace
{txt}q921_totfamdaylabkha11_5 already numeric; no {res}replace
{txt}q921_1_area_4 already numeric; no {res}replace
{txt}q921_1_area_5 already numeric; no {res}replace
{txt}q921_1_areaunit_4 already numeric; no {res}replace
{txt}q921_1_areaunit_5 already numeric; no {res}replace
{txt}
{com}. ds, has(type string)
{txt}{col 1}Id{col 15}q915_const~1{col 29}q917_const~1

{com}. local str_var `r(varlist)'
{txt}
{com}. foreach var of local str_var {c -(}
{txt}  2{com}.         qui replace `var'="" if (`var'=="-")
{txt}  3{com}. {c )-}
{txt}
{com}. *
. 
. /// Destring and recode variables
> destring *, replace
{txt}Id contains nonnumeric bytes; no {res}replace
{txt}q910_ownasskha11_1 already numeric; no {res}replace
{txt}q910_ownasskha11_2 already numeric; no {res}replace
{txt}q910_ownasskha11_3 already numeric; no {res}replace
{txt}q910_ownasskha11_4 already numeric; no {res}replace
{txt}q910_ownasskha11_5 already numeric; no {res}replace
{txt}q911_totvalkha11_1 already numeric; no {res}replace
{txt}q911_totvalkha11_2 already numeric; no {res}replace
{txt}q911_totvalkha11_3 already numeric; no {res}replace
{txt}q912_totvalnow_1 already numeric; no {res}replace
{txt}q912_totvalnow_2 already numeric; no {res}replace
{txt}q912_totvalnow_3 already numeric; no {res}replace
{txt}q913_increntlast12mon_1 already numeric; no {res}replace
{txt}q913_increntlast12mon_2 already numeric; no {res}replace
{txt}q913_increntlast12mon_3 already numeric; no {res}replace
{txt}q913_increntlast12mon_4 already numeric; no {res}replace
{txt}q913_increntlast12mon_5 already numeric; no {res}replace
{txt}q914_YYcons_1 already numeric; no {res}replace
{txt}q914_YYcons_2 already numeric; no {res}replace
{txt}q914_YYcons_3 already numeric; no {res}replace
{txt}q915_constmatcost_1 has all characters numeric; {res}replaced {txt}as {res}long
{txt}(60 missing values generated)
{res}{txt}q915_constmatcost_2 already numeric; no {res}replace
{txt}q915_constmatcost_3 already numeric; no {res}replace
{txt}q915_constmatcost_4 already numeric; no {res}replace
{txt}q915_constmatcost_5 already numeric; no {res}replace
{txt}q916_constotwagpayhirelab_1 already numeric; no {res}replace
{txt}q916_constotwagpayhirelab_2 already numeric; no {res}replace
{txt}q916_constotwagpayhirelab_3 already numeric; no {res}replace
{txt}q916_constotwagpayhirelab_4 already numeric; no {res}replace
{txt}q916_constotwagpayhirelab_5 already numeric; no {res}replace
{txt}q917_constotfamday_1 has all characters numeric; {res}replaced {txt}as {res}int
{txt}(57 missing values generated)
{res}{txt}q917_constotfamday_2 already numeric; no {res}replace
{txt}q917_constotfamday_3 already numeric; no {res}replace
{txt}q917_constotfamday_4 already numeric; no {res}replace
{txt}q917_constotfamday_5 already numeric; no {res}replace
{txt}q918_mainsinkha11_1 already numeric; no {res}replace
{txt}q918_mainsinkha11_2 already numeric; no {res}replace
{txt}q918_mainsinkha11_3 already numeric; no {res}replace
{txt}q918_mainsinkha11_4 already numeric; no {res}replace
{txt}q918_mainsinkha11_5 already numeric; no {res}replace
{txt}q919_mainmatcoskha11_1 already numeric; no {res}replace
{txt}q919_mainmatcoskha11_2 already numeric; no {res}replace
{txt}q919_mainmatcoskha11_3 already numeric; no {res}replace
{txt}q919_mainmatcoskha11_4 already numeric; no {res}replace
{txt}q919_mainmatcoskha11_5 already numeric; no {res}replace
{txt}q920_totwagepayhirelabkha_1 already numeric; no {res}replace
{txt}q920_totwagepayhirelabkha_2 already numeric; no {res}replace
{txt}q920_totwagepayhirelabkha_3 already numeric; no {res}replace
{txt}q920_totwagepayhirelabkha_4 already numeric; no {res}replace
{txt}q920_totwagepayhirelabkha_5 already numeric; no {res}replace
{txt}q921_totfamdaylabkha11_1 already numeric; no {res}replace
{txt}q921_totfamdaylabkha11_2 already numeric; no {res}replace
{txt}q921_totfamdaylabkha11_3 already numeric; no {res}replace
{txt}q921_totfamdaylabkha11_4 already numeric; no {res}replace
{txt}q921_totfamdaylabkha11_5 already numeric; no {res}replace
{txt}q921_1_area_4 already numeric; no {res}replace
{txt}q921_1_area_5 already numeric; no {res}replace
{txt}q921_1_areaunit_4 already numeric; no {res}replace
{txt}q921_1_areaunit_5 already numeric; no {res}replace
{txt}
{com}. ds, has(type numeric)
{txt}{col 1}q910_ownas~1{col 15}q912_totva~3{col 29}q915_const~2{col 43}q917_const~2{col 57}q919_mainm~2{col 71}q921_totfa~2
{col 1}q910_ownas~2{col 15}q913_incre~1{col 29}q915_const~3{col 43}q917_const~3{col 57}q919_mainm~3{col 71}q921_totfa~3
{col 1}q910_ownas~3{col 15}q913_incre~2{col 29}q915_const~4{col 43}q917_const~4{col 57}q919_mainm~4{col 71}q921_totfa~4
{col 1}q910_ownas~4{col 15}q913_incre~3{col 29}q915_const~5{col 43}q917_const~5{col 57}q919_mainm~5{col 71}q921_totfa~5
{col 1}q910_ownas~5{col 15}q913_incre~4{col 29}q916_const~1{col 43}q918_mains~1{col 57}q920_totwa~1{col 71}q921_1_a~a_4
{col 1}q911_totva~1{col 15}q913_incre~5{col 29}q916_const~2{col 43}q918_mains~2{col 57}q920_totwa~2{col 71}q921_1_a~a_5
{col 1}q911_totva~2{col 15}q914_YYcon~1{col 29}q916_const~3{col 43}q918_mains~3{col 57}q920_totwa~3{col 71}q921_1_a~t_4
{col 1}q911_totva~3{col 15}q914_YYcon~2{col 29}q916_const~4{col 43}q918_mains~4{col 57}q920_totwa~4{col 71}q921_1_a~t_5
{col 1}q912_totva~1{col 15}q914_YYcon~3{col 29}q916_const~5{col 43}q918_mains~5{col 57}q920_totwa~5
{col 1}q912_totva~2{col 15}q915_const~1{col 29}q917_const~1{col 43}q919_mainm~1{col 57}q921_totfa~1

{com}. local num_var `r(varlist)'
{txt}
{com}. foreach var of local num_var {c -(}
{txt}  2{com}.         qui replace `var'=.b if mi(`var') // Blank response (but not a valid response)
{txt}  3{com}.         qui recode `var' (-999=.d) (-777=.r) (-666=.n) (-333=.b) (-555=.) // -999 "Don't Know" -888 "Others" -777 "Refuse" -666 "N/A" -333 "Missing" -555 "Valid Skip"
{txt}  4{com}. {c )-}
{txt}
{com}. *
. 
. /// Logic check
> forval i=1/5{c -(}
{txt}  2{com}.         if inrange(`i',1,3) {c -(}
{txt}  3{com}.                 replace q911_totvalkha11_`i'=.m if ((q910_ownasskha11_`i'==2) & !mi(q911_totvalkha11_`i'))
{txt}  4{com}.                 replace q912_totvalnow_`i'=.m if ((q910_ownasskha11_`i'==2) & !mi(q912_totvalnow_`i'))
{txt}  5{com}.                 replace q914_YYcons_`i'=.m if ((q910_ownasskha11_`i'==2) & !mi(q914_YYcons_`i'))
{txt}  6{com}.         {c )-}
{txt}  7{com}.         else {c -(}
{txt}  8{com}.                 replace q921_1_area_`i'=.m if ((q910_ownasskha11_`i'==2) & !mi(q921_1_area_`i'))
{txt}  9{com}.                 replace q921_1_areaunit_`i'=.m if ((q910_ownasskha11_`i'==2) & !mi(q921_1_areaunit_`i'))
{txt} 10{com}.         {c )-}
{txt} 11{com}.         replace q913_increntlast12mon_`i'=.m if ((q910_ownasskha11_`i'==2) & !mi(q913_increntlast12mon_`i'))
{txt} 12{com}.         replace q915_constmatcost_`i'=.m if ((q910_ownasskha11_`i'==2) & !mi(q915_constmatcost_`i'))
{txt} 13{com}.         replace q916_constotwagpayhirelab_`i'=.m if ((q910_ownasskha11_`i'==2) & !mi(q916_constotwagpayhirelab_`i'))
{txt} 14{com}.         replace q917_constotfamday_`i'=.m if ((q910_ownasskha11_`i'==2) & !mi(q917_constotfamday_`i'))
{txt} 15{com}.         replace q918_mainsinkha11_`i'=.m if ((q910_ownasskha11_`i'==2) & !mi(q918_mainsinkha11_`i'))
{txt} 16{com}.         replace q919_mainmatcoskha11_`i'=.m if ((q910_ownasskha11_`i'==2) & !mi(q919_mainmatcoskha11_`i'))
{txt} 17{com}.         replace q920_totwagepayhirelabkha_`i'=.m if ((q910_ownasskha11_`i'==2) & !mi(q920_totwagepayhirelabkha_`i'))
{txt} 18{com}.         replace q921_totfamdaylabkha11_`i'=.m if ((q910_ownasskha11_`i'==2) & !mi(q921_totfamdaylabkha11_`i'))
{txt} 19{com}.         
.         // maintenance cost
.         replace q919_mainmatcoskha11_`i'=.m if ((q918_mainsinkha11_`i'==2) & !mi(q919_mainmatcoskha11_`i'))
{txt} 20{com}.         replace q920_totwagepayhirelabkha_`i'=.m if ((q918_mainsinkha11_`i'==2) & !mi(q920_totwagepayhirelabkha_`i'))
{txt} 21{com}.         replace q921_totfamdaylabkha11_`i'=.m if ((q918_mainsinkha11_`i'==2) & !mi(q921_totfamdaylabkha11_`i'))
{txt} 22{com}. 
. {c )-}
{txt}(3 real changes made, 3 to missing)
(3 real changes made, 3 to missing)
(2 real changes made, 2 to missing)
(3 real changes made, 3 to missing)
(6 real changes made, 6 to missing)
(5 real changes made, 5 to missing)
(5 real changes made, 5 to missing)
(6 real changes made, 6 to missing)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(17 real changes made, 17 to missing)
(14 real changes made, 14 to missing)
(13 real changes made, 13 to missing)
(7 real changes made, 7 to missing)
(4 real changes made, 4 to missing)
(1 real change made, 1 to missing)
(2 real changes made, 2 to missing)
(2 real changes made, 2 to missing)
(2 real changes made, 2 to missing)
(2 real changes made, 2 to missing)
(7 real changes made, 7 to missing)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(5 real changes made, 5 to missing)
(2 real changes made, 2 to missing)
(0 real changes made)
(2 real changes made, 2 to missing)
(4 real changes made, 4 to missing)
(4 real changes made, 4 to missing)
(4 real changes made, 4 to missing)
(3 real changes made, 3 to missing)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(9 real changes made, 9 to missing)
(8 real changes made, 8 to missing)
(8 real changes made, 8 to missing)
(7 real changes made, 7 to missing)
(8 real changes made, 8 to missing)
(8 real changes made, 8 to missing)
(9 real changes made, 9 to missing)
(1 real change made, 1 to missing)
(1 real change made, 1 to missing)
(1 real change made, 1 to missing)
(2 real changes made, 2 to missing)
(2 real changes made, 2 to missing)
(2 real changes made, 2 to missing)
(11 real changes made, 11 to missing)
(8 real changes made, 8 to missing)
(12 real changes made, 12 to missing)
(10 real changes made, 10 to missing)
(10 real changes made, 10 to missing)
(9 real changes made, 9 to missing)
(10 real changes made, 10 to missing)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(8 real changes made, 8 to missing)
(7 real changes made, 7 to missing)
(7 real changes made, 7 to missing)

{com}. *
. 
. /****************************************************************
>         SECTION X: Save and Exit
> ****************************************************************/
. 
. qui compress
{txt}
{com}. save "${c -(}builddta{c )-}/followup_2014/SectionJ1_Asset_part1_cleaned.dta", replace
{txt}file C:/Users/ftac2/Dropbox/Rainfall insurance India - Round 2/Data Analysis/build/output/datasets/followup_2014/SectionJ1_Asset_part1_cleaned.dta saved

{com}. 
. cap file close _all
{txt}
{com}. cap log close
{smcl}
{com}{sf}{ul off}