{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}C:/Users/SLee/Dropbox/Rainfall insurance India - Round 2/Data Analysis/build/logs/SectionE6_KharifCrop_PostHarvest_LaborCost_clean.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}18 May 2016, 15:44:02
{txt}
{com}. 
. 
. /****************************************************************
>         SECTION 1: Import Raw Data                                                                                                      
> ****************************************************************/
. 
. // Section E8
. use "${c -(}followup_data{c )-}/AP Raw/SectionELabor6_1.dta", clear
{txt}
{com}. append using "${c -(}followup_data{c )-}/TN Raw/SectionELabor6_1.dta" 
{txt}{p 0 7 2}
(note: variable
q563_1_oth_prokha11unit was 
str8, now str32 to accommodate using data's values)
{p_end}

{com}. append using "${c -(}followup_data{c )-}/UP Raw/SectionELabor6_1.dta" 
{txt}{p 0 7 2}
(note: variable
q565_proquangiftkha11 was 
str6, now str9 to accommodate using data's values)
{p_end}

{com}. isid Id subid
{txt}
{com}. 
. /// Destring and recode variables
> qui destring *, replace
{txt}
{com}. ds, has(type numeric)
{txt}{col 1}subid{col 15}q563_1_pro~t{col 29}q566_sale~11{col 43}q567_anif~11{col 57}q569_invq~11
{col 1}q563_proq~11{col 15}q563_2_pa~10{col 29}q566_1_sa~11{col 43}q568_home~11

{com}. local num_var `r(varlist)'
{txt}
{com}. foreach var of local num_var {c -(}
{txt}  2{com}.         qui replace `var'=.b if mi(`var') // Blank response (but not a valid response)
{txt}  3{com}.         qui recode `var' (-999=.d) (-777=.r) (-666=.n) (-333=.b) (-555=.) // -999 "Don't Know" -888 "Others" -777 "Refuse" -666 "N/A" -333 "Missing" -555 "Valid Skip"
{txt}  4{com}. {c )-}
{txt}
{com}. *
. // Label variables
. label var Id "Household ID"
{txt}
{com}. label var subid "SubId"
{txt}
{com}. 
. label   var     q563_proquankha11       "Kh14 Production - Quantity"
{txt}
{com}. label   var     q563_1_prokha11unit     "Kh14 Production - Units"
{txt}
{com}. label   var     q563_1_oth_prokha11unit "Kh14 Production - Units (Other)"
{txt}
{com}. label   var     q563_2_pasprounitkha10  "Kh14 Production - KG/Unit"
{txt}
{com}. label   var     q565_proquangiftkha11   "Kh14 Production - Given as gift/payment?"
{txt}
{com}. label   var     q566_salequakha11       "Kh14 Production - Sale Quantity"
{txt}
{com}. label   var     q566_1_salevalkha11     "Kh14 Production - Sale Value"
{txt}
{com}. label   var     q567_anifeedquankha11   "Kh14 Production - Animal Feed Qty"
{txt}
{com}. label   var     q568_homeconquakha11    "Kh14 Production - Home Consumption Qty"
{txt}
{com}. label   var     q569_invquankha11       "Kh14 Production -Inventory/further processing Qty"
{txt}
{com}. 
. /****************************************************************
>         SECTION X: Save and Exit
> ****************************************************************/
. 
. qui compress
{txt}
{com}. save "${c -(}builddta{c )-}/followup_2014/SectionE8_KharifCrop_MainProduct_cleaned.dta", replace
{txt}(note: file C:/Users/SLee/Dropbox/Rainfall insurance India - Round 2/Data Analysis/build/output/datasets/followup_2014/SectionE8_KharifCrop_MainProduct_cleaned.dta not found)
file C:/Users/SLee/Dropbox/Rainfall insurance India - Round 2/Data Analysis/build/output/datasets/followup_2014/SectionE8_KharifCrop_MainProduct_cleaned.dta saved

{com}. 
. cap file close _all
{txt}
{com}. cap log close
{smcl}
{com}{sf}{ul off}