{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}C:/Users/SLee/Dropbox/Rainfall insurance India - Round 2/Data Analysis/build/logs/SectionB_WageIncome_clean.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}20 Apr 2016, 15:54:39
{txt}
{com}. 
. 
. /****************************************************************
>         SECTION 1: Import Raw Data                                                                                                      
> ****************************************************************/
. 
. 
. use "${c -(}followup_data{c )-}/AP Raw/SectionECostRoster_1.dta", clear
{txt}
{com}. append using "${c -(}followup_data{c )-}/TN Raw/SectionECostRoster_1.dta" 
{txt}
{com}. append using "${c -(}followup_data{c )-}/UP Raw/SectionECostRoster_1.dta" 
{txt}{p 0 7 2}
(note: variable
q426_irrpurrelatoth was 
str38, now str63 to accommodate using data's values)
{p_end}

{com}. isid Id subid
{txt}
{com}. 
. // Destring and recode variables
. destring subid q*, replace
{txt}subid has all characters numeric; {res}replaced {txt}as {res}byte
{txt}q4152_cropcode has all characters numeric; {res}replaced {txt}as {res}int
{txt}q416_1_bulowndayuse has all characters numeric; {res}replaced {txt}as {res}int
{txt}q416_2_bulowndayuse has all characters numeric; {res}replaced {txt}as {res}int
{txt}q417_bulhireunit has all characters numeric; {res}replaced {txt}as {res}int
{txt}q418_bulhiredays has all characters numeric; {res}replaced {txt}as {res}int
{txt}q419_traowndays has all characters numeric; {res}replaced {txt}as {res}int
{txt}q420_trahireunit has all characters numeric; {res}replaced {txt}as {res}byte
{txt}q421_trahireval has all characters numeric; {res}replaced {txt}as {res}long
{txt}q422_ownirrdayuse has all characters numeric; {res}replaced {txt}as {res}int
{txt}q423_ownirrexpe has all characters numeric; {res}replaced {txt}as {res}int
{txt}q424_irrpurdayuse has all characters numeric; {res}replaced {txt}as {res}int
{txt}q425_irrpurval has all characters numeric; {res}replaced {txt}as {res}long
{txt}q426_irrpurrelat has all characters numeric; {res}replaced {txt}as {res}int
{txt}q426_irrpurrelatoth contains nonnumeric characters; no {res}replace
{txt}q427_trancost contains nonnumeric characters; no {res}replace
{txt}q428_othmatinputcost has all characters numeric; {res}replaced {txt}as {res}int
{txt}
{com}. ds, has(type numeric)
{txt}{col 1}subid{col 15}q416_2_bul~e{col 29}q419_traow~s{col 43}q422_ownir~e{col 57}q425_irrpu~l
{col 1}q4152_crop~e{col 15}q417_bulhi~t{col 29}q420_trahi~t{col 43}q423_ownir~e{col 57}q426_irrpu~t
{col 1}q416_1_bul~e{col 15}q418_bulhi~s{col 29}q421_trahi~l{col 43}q424_irrpu~e{col 57}q428_othma~t

{com}. local num_var `r(varlist)'
{txt}
{com}. foreach var of local num_var {c -(}
{txt}  2{com}.         qui replace `var'=.b if mi(`var') // Blank response (but not a valid response)
{txt}  3{com}.         qui recode `var' (-999=.d) (-777=.r) (-666=.n) (-333=.b) (-555=.) // -999 "Don't Know" -888 "Others" -777 "Refuse" -666 "N/A" -333 "Missing" -555 "Valid Skip"
{txt}  4{com}. {c )-}
{txt}
{com}. *
. 
. 
. //Label Variables
. label define yesno 1 "Yes" 2 "No"
{txt}
{com}. 
. label var Id "Household ID"
{txt}
{com}. label var subid "SubId"
{txt}
{com}. label var q4152_cropcode "Crop code"
{txt}
{com}. label define cropcode1 1 "Paddy "2 "Wheat"3 "Barley"4 "Maize"5 "Jawar"6 "Bajra"7 "Ragi"8 "Other Cereals and millets"9 "Black Gram (Urd)"10 "Green Gram (Moong)"11 "Pigeon Pea (Arhar,Tur)"12 "Horse Gram (Kulthi)"13 "Cowpea (Lobia)"14 "Kidney Bean (Moth)"15 "Lentil (Massor)"16 "Fiels Pea (Matar)]"17 "Bengal Gram (Chana)"18 "Other Pulses"19 "Sesamam ( Til )"20 "Groundnut"21 "Castor"22 "Sunflower"23 "Niger ( Ramtil)"24 "Soyabean"25 "Safflower ( Kusum, Kardi)"26 "Rapeseed/ Mustard ( Sarsoan)'"27 "Indian Mustard (Rai)"28 "Lineseed (Alsi)"29 "Other Oilseeds"30 "Cotton (Kapas)"31 "Brown Hemp ( Patsan ,Mesta)"32 "Jute"33 "Rozelle (Patua)"34 "Sannehemp : Bombay Hemp ( Sann) "35 "Sisal Hemp : Agava ( Seesal)"36 "Other fibre crops"37 "Sugarcane"38 "Tapioca"39 "Othere Sugar & Starch Crops"40 "Baramuda Grass ( Doob)"41 "Blue Panic ( Neelon Ghas)"42 "Carpet Legume ( Sem)"43 "Common Vetch ( Bakla)"44 "Elephant grass,Napier Grass"45 "Egyptian Clover ( Berseem )"46 "Guinea Grass"47 "Indian Clover (Senji)"48 "Lucerne ,Alfalfa ( Rajka)"49 "Para Grass"50 "Rhodes Grass"51 "Soyabean"52 "Star Grass"53 "Sudan Grass"54 "Canary Grass"55 "Other Grasses ( Other Fodder)"56 "Jawar Fodder"57 "Bajra Fodder"58 "Maize Fodder"59 "Ragi Fodder"60 "Oat/Jai Fooder"61 "Lobiya Fodder"62 "Other food Crops Grown as Fodder"63 "Ash Gourd (Kohla)"64 "Beet Root ( Chukandar)"65 "Bitter Gourd ( Kerela)"66 "Bottle Gourd (Louki)"67 "Brinjal ,Eggplant ( Baingan)"68 "Broad Bean ( Baakla )"69 "Cabbage (Pattagobby )"70 "Carrot ( Gajat)"71 "Cauliflower ( Phool Gobby )"72 "Cluster Bean ( Guvar Ki Fali)"73 "Cowpea (Lobia)"74 "Cress ,Garden Cress( Pani Dhleem)"75 "Cucumber ( Khera)"76 "Double Bean"77 "Drum Stick ( Sejana)"78 "Elephant Ear, Edible Arum (Akhi ,Arvi)"79 "Elephant Foot (Gimmy Kand )"80 "French Bean ( Jungli Sem , Frans Bean)"81 "Garden Pea, Pea,(Matar)"82 "Goose Foot ( Bathua )"83 "Indian Bean ( Sem)"84 "Knolknol ( Gaath Gobhi)"85 "Lady's Finger( Bhindi)"86 "Lettuce (Salad)"87 "Lime Bean"88 "Little Gourd (Kundroo, Tindora)"89 "Mountain Spinach ( Pahari Palak)"90 "Musk Melon (Kharbooja)"91 "Onion (Piaz)"92 "Pointed Gourd ( Parwal)"93 "Potato (Aaloo)"94 "Pumpkin ( Petha)"95 "Radish ( Mooli)"96 "Red Pumpkin ( Sitaphal ,Kaddu)"97 "Ridge Gourd ( Tori)"98 "Round Gourd ( Tinda)"99 "Smoth Gourd ( Kali Tori)"100 "Snake Guard ( Chachera, Chachinda)"101 "Spinach ( Palak)"102 "Sword Bean"103 "Sweet Potato ( Sakar Kandi)"104 "Tomato ( Tamattar)"105 "Turnip ( Saljam)"106 "Velet Bean ( Khamch ,Tohar Sem)"107 "Water Melon ( Tarbooj)"108 "Yam ( Tataaloo )"109 "Other Vegetables"110 " Almond ( Badam)"111 "Apple ( Seb)"112 "Apricot (Khumani)"113 "Banana (Kela)"114 "Bread Fruit ( Khadel)"115 "Bullock Heart (Ramphal )"116 "Cape Gooseberry ( Rasbhari)"117 "Cashew ( Kaju)"118 "Cherry (Cherry )"119 "Citron ( Gulgul )"120 "Custard Apple ( Sarifa)"121 "Date Palm (Khajoor)"122 "Fig (Anjeer)"123 "Grape Fruit(Grape Fruit)"124 "Grapevine (Angur)"125 "Guava ( Armood)"126 "Jack Fruit ( Kat-Hal )"127 "Jujube ( Ber)"128 "Lemon ( Bara- Nemboo)"129 "Lime, Acid lime,Sour lime (Kagzi Nemboo)"130 "Litchi ( Leechi )"131 "Laquat( Lokat)"132 "Mango (Aam)"133 "Mangosteen (Mangosteen )"134 "Malbuerry (Raitun)"135 "Papaya (Papita)"136 "Peach ( Aaroo)"137 "Pear (Naaspaati)"138 "Pineapple (Annanas)"139 "Pulm ( Aaloo Bhukhara)"140 "Pomegranate ( Anaar,Dadim)"141 "Raspberry, (Raspbherry, Rasbhary)"142 "Rough Lemon (Nemboo)"143 "Sapota ,Sapodilla Plum (Cheeku)"144 "Shaddock ,Pomelo ( Chakotra)"145 "Santra Orange,Mandarian Orange"146 "Strawberry (Strawberry )"147 "Sweet Lime ( Meetha Nemboo)"148 "Sweet Orange ,Malta ( Mausmee)"149 "Walnut (Akhroat )"150 "Other Fruits"151 "Other Dry Fruits"152 "Amise"153 "Aromatic Cardamon ( Chhoti Elaichi )"154 "Betelvine (Pan)"155 "Bishop's Weed ( Ajwan,Ajamo)"156 "Black Mustard ( Kali Sarson ,Kali Rai') "157 "Black Pepper ( Kali Mirch )"158 "Cardomam (Elaichi )"159 "Chilli' ( Lal Mirch)"160 "Coriander ( Dhaniya)"161 "Cumin ( Jeera)"162 "Dill Seed ( Soya, Suwa)"163 "Fennel ( Sonf ,Variali)"164 "Fanugreek ( Maythik, Methi)"165 "Garlic ( Lehsoon ,Lasan)"166 "Ginger ( Adrakh )"167 "Indian Mustard ( Raie)"168 "Large Cardamon ( Bari Elaichy)"169 "Long Pepper ( Mirchi)"170 "Mint ( Pudeena)"171 "Ntmeg ( Jaiphal )"172 "Turmeric ( Haldi )"173 "White Mustard ( Banarsi Raie)"174 "Other Condiments & Spices)"175 "Indian Hemp ( Bhang)"176 "Indigo (Kneel)"177 "Poppy -Opium Poppy( Aphim)"178 "Poppy (Posta)"179 "Saffron (Kesar)"180 "Tobaccco ( Tambaku)"181 "Blonde Psyllium (Isapgol )"182 "Indian Privet ( Mehandi)"183 "Cluster Bean(Gawar)"184 "Other Drugs ,Dyes & Narcotiecs"185 "Areca Palm( Kattha)"186 "Cocao (Koka ,Kahva)"187 "Chinchona ( Quinine)"188 "Coconut ( Narial)"189 "Coffee ( Coffee)"190 "Para Rubber ( Rubber)"191 "Tea ( Chaie)"192 "Banana"193 "Mango"194 "Arcanut"195 "Other Plantations"196 "Rose"197 "Tube Rose"198 "Jasmine"199 "Marigold"200 "Gladiolus"201 "Orchids"202 "Other Flowers"203 "Barseem Seed"
{txt}
{com}. label value q4152_cropcode cropcode
{txt}
{com}. label var q416_1_bulowndayuse "Bullock - Own (days)"
{txt}
{com}. label var q416_2_bulowndayuse "Bullock - Own (days)" //check variable - repeated twice?
{txt}
{com}. label var q417_bulhireunit "Bullock - Hired (Units)"
{txt}
{com}. label var q418_bulhiredays "Bullock - Hired (Days)"
{txt}
{com}. label var q419_traowndays "Tractor - Own (days)" 
{txt}
{com}. label var q420_trahireunit "Tractor - Hired (Units)"
{txt}
{com}. label var q421_trahireval "Tractor - Hired (Days)"
{txt}
{com}. label var q422_ownirrdayuse "Irrigation - Own (Days)"
{txt}
{com}. label var q423_ownirrexpe "Irrigation - Own (Expenditure)"
{txt}
{com}. label var q424_irrpurdayuse "Irrigation - Purchased (Days)"
{txt}
{com}. label var q425_irrpurval "Irrigation - Purchased (Value)"
{txt}
{com}. label var q426_irrpurrelat "Irrigation - Purchased (relation)"
{txt}
{com}. label var q426_irrpurrelatoth "Irrigation - Purchased (relation - Other)"
{txt}
{com}. label var q427_trancost "Transport Costs"
{txt}
{com}. label var q428_othmatinputcost "Other material inputs costs"
{txt}
{com}. 
. label define relation 1 "Immediate family" 2 "Same sub-caste" 3 "Same caste" 4 "Friend" 5 "No Relation" -888 "Other(specify)" -777 "Refuse"
{txt}
{com}. label value q426_irrpurrelat relation
{txt}
{com}. 
. label define units 1 "KGS" 2 "Liter" 3 "Quintals" -888 "Other (SPECIFY)" //organic manure unit code 
{txt}
{com}. 
.          
. /****************************************************************
>         SECTION X: Save and Exit
> ****************************************************************/
. 
. qui compress
{txt}
{com}. save "${c -(}builddta{c )-}/followup_2014/SectionE2_KharifCrop_Cost_cleaned.dta", replace
{txt}(note: file C:/Users/SLee/Dropbox/Rainfall insurance India - Round 2/Data Analysis/build/output/datasets/followup_2014/SectionE2_KharifCrop_Cost_cleaned.dta not found)
file C:/Users/SLee/Dropbox/Rainfall insurance India - Round 2/Data Analysis/build/output/datasets/followup_2014/SectionE2_KharifCrop_Cost_cleaned.dta saved

{com}. 
. cap file close _all
{txt}
{com}. cap log close
{smcl}
{com}{sf}{ul off}