{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}C:/Users/SLee/Dropbox/Rainfall insurance India - Round 2/Data Analysis/build/logs/SectionB_WageIncome_clean.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res} 3 Jun 2016, 16:36:53
{txt}
{com}. 
. /****************************************************************
>         SECTION 1: Import Raw Data                                                                                                      
> ****************************************************************/
. 
. // Master Data
. use "${c -(}builddta{c )-}/followup_2014/MasterData_cleaned.dta", clear
{txt}
{com}. keep Id q213_nonagrwageempkha11
{txt}
{com}. tempfile Id_q213
{txt}
{com}. save `Id_q213'
{txt}file C:\Users\SLee\AppData\Local\Temp\ST_06000001.tmp saved

{com}. 
. // Section B2
. use "${c -(}followup_data{c )-}/AP Raw/SectionBWageIncomeP4_1.dta", clear
{txt}
{com}. append using "${c -(}followup_data{c )-}/TN Raw/SectionBWageIncomeP4_1.dta" 
{txt}{p 0 7 2}
(note: variable
q216_occprim_oth was 
str17, now str20 to accommodate using data's values)
{p_end}

{com}. append using "${c -(}followup_data{c )-}/UP Raw/SectionBWageIncomeP4_1.dta" 
{txt}{p 0 7 2}
(note: variable
q213_1_baseHHrosid was 
str4, now str28 to accommodate using data's values)
{p_end}

{com}. isid Id subid
{txt}
{com}. 
. // Destring and recode variables
. destring subid q*, replace
{txt}subid has all characters numeric; {res}replaced {txt}as {res}byte
{txt}q213_1_baseHHrosid contains nonnumeric characters; no {res}replace
{txt}q213_2_Hhrosid contains nonnumeric characters; no {res}replace
{txt}q214_totdaynonagriwork has all characters numeric; {res}replaced {txt}as {res}int
{txt}q218_totearnlocnonagr has all characters numeric; {res}replaced {txt}as {res}long
{txt}q215_indnonagriworkprim has all characters numeric; {res}replaced {txt}as {res}int
{txt}q215_indnonagriworkprim_oth contains nonnumeric characters; no {res}replace
{txt}q216_occprim has all characters numeric; {res}replaced {txt}as {res}int
{txt}q216_occprim_oth contains nonnumeric characters; no {res}replace
{txt}q217_avdaiwag has all characters numeric; {res}replaced {txt}as {res}long
{txt}q218_1_relempl has all characters numeric; {res}replaced {txt}as {res}int
{txt}q218_1_relempl_oth contains nonnumeric characters; no {res}replace
{txt}
{com}. ds, has(type numeric)
{txt}{col 1}subid{col 15}q214_totda~k{col 29}q218_totea~r{col 43}q215_indno~m{col 57}q216_occprim{col 71}q217_avdai~g{col 85}q218_1_rel~l

{com}. local num_var `r(varlist)'
{txt}
{com}. foreach var of local num_var {c -(}
{txt}  2{com}.         qui replace `var'=.b if mi(`var') // Blank response (but not a valid response)
{txt}  3{com}.         qui recode `var' (-999=.d) (-777=.r) (-666=.n) (-333=.b) (-555=.) // -999 "Don't Know" -888 "Others" -777 "Refuse" -666 "N/A" -333 "Missing" -555 "Valid Skip"
{txt}  4{com}. {c )-}
{txt}
{com}. *
. 
. 
. // Clean variables
. 
. /// q213_2_Hhrosid
> /// In the dataset it is NOT ID, but actually name of wage earners. Rename variable as "wage earner"
> rename q213_2_Hhrosid q213_2_wagearname
{res}{txt}
{com}. 
. // Daily Wage & # of days worked & Total earning
. // There are observations where total earning and daily wage are mistakenly swapped. Need to detect them and correct them.
. gen swapped = 1 if (q214_totdaynonagriwork * q218_totearnlocnonagr == q217_avdaiwag)
{txt}(2071 missing values generated)

{com}. gen temp = q218_totearnlocnonagr
{txt}(48 missing values generated)

{com}. replace q218_totearnlocnonagr = q217_avdaiwag if (swapped==1)
{txt}(16 real changes made)

{com}. replace q217_avdaiwag = temp if (swapped==1)
{txt}(16 real changes made)

{com}. drop swapped temp
{txt}
{com}. 
. // Generate outlier-indicator
. // Here we define outliers as "Q(25)-3IQR < x < Q(75)+3IQR"
. foreach var in q218_totearnlocnonagr q217_avdaiwag {c -(}
{txt}  2{com}.         gen byte `var'_outlier=0
{txt}  3{com}.         order `var'_outlier, after(`var')
{txt}  4{com}.         qui sum `var', detail
{txt}  5{com}.         scalar `var'_IQR = r(p75)-r(p25)
{txt}  6{com}.         replace `var'_outlier=1 if !inrange(`var',r(p25)-(3*`var'_IQR),r(p75)+(3*`var'_IQR))
{txt}  7{com}.         scalar drop `var'_IQR
{txt}  8{com}. {c )-}
{txt}(75 real changes made)
(41 real changes made)

{com}. *
. 
. // Label variables
. label var Id "Household ID"
{txt}
{com}. label var subid "Roster ID"
{txt}
{com}. 
. label var  q213_1_baseHHrosid "Baseline HH Roster ID"
{txt}
{com}. label var  q213_2_wagearname "HH Roster ID"
{txt}
{com}. label var  q214_totdaynonagriwork "Total Days - Non-Agriculture Work"
{txt}
{com}. label var  q218_totearnlocnonagr "Total Earnings - Non-Agricultural Work"
{txt}
{com}. label var  q218_totearnlocnonagr_outlier "Is 'Total Earnings - Non-Agricultural Work' an outlier?"
{txt}
{com}. 
. replace q215_indnonagriworkprim_oth="VALID SKIP" if q215_indnonagriworkprim_oth=="-555"
{txt}(1990 real changes made)

{com}. replace q215_indnonagriworkprim_oth="MISSING" if q215_indnonagriworkprim_oth=="0"
{txt}(2 real changes made)

{com}. replace q215_indnonagriworkprim_oth="100 DAY JOB" if q215_indnonagriworkprim_oth=="100 DAY S WORK"
{txt}(1 real change made)

{com}. replace q215_indnonagriworkprim_oth="ACCOUNTANT" if  q215_indnonagriworkprim_oth=="ACCOTENT"
{txt}(1 real change made)

{com}. replace q215_indnonagriworkprim_oth="CATERING" if q215_indnonagriworkprim_oth=="CATRING" 
{txt}(1 real change made)

{com}. replace q215_indnonagriworkprim_oth="CLOTHES SELLING" if q215_indnonagriworkprim_oth=="CLATHS SALING"
{txt}(1 real change made)

{com}. replace q215_indnonagriworkprim_oth="CLOTHES WASHING" if q215_indnonagriworkprim_oth=="CLOTHS WASHING" | q215_indnonagriworkprim_oth=="COLTH VASH" | q215_indnonagriworkprim_oth=="WACHMEN" | q215_indnonagriworkprim_oth=="WASHER MAN" | q215_indnonagriworkprim_oth=="WASHERMAN"
{txt}(7 real changes made)

{com}. replace q215_indnonagriworkprim_oth="MASON" if q215_indnonagriworkprim_oth=="CUNSTRUCTION" | q215_indnonagriworkprim_oth=="HOUSING CONSTRUCTION"
{txt}(2 real changes made)

{com}. replace q215_indnonagriworkprim_oth="CARPENTER" if q215_indnonagriworkprim_oth=="CORPENDOR" | q215_indnonagriworkprim_oth=="PARADALU"
{txt}(2 real changes made)

{com}. replace q215_indnonagriworkprim_oth="ELECTRICIAN" if q215_indnonagriworkprim_oth=="POWAR" | q215_indnonagriworkprim_oth=="ELECRICTION" | q215_indnonagriworkprim_oth=="ELECTRICAL"
{txt}(3 real changes made)

{com}. replace q215_indnonagriworkprim_oth="FACTORY" if q215_indnonagriworkprim_oth=="FACTORY WORK" | q215_indnonagriworkprim_oth=="PICE FACTRI" | q215_indnonagriworkprim_oth=="FOOD FACTORY"
{txt}(3 real changes made)

{com}. replace q215_indnonagriworkprim_oth="CONFECTIONARY" if q215_indnonagriworkprim_oth=="HALWAI"
{txt}(1 real change made)

{com}. replace q215_indnonagriworkprim_oth="HELPER" if q215_indnonagriworkprim_oth=="HELPAR TELI PHONE" | q215_indnonagriworkprim_oth=="MYAREGI HELPAR" | q215_indnonagriworkprim_oth=="SCHOOL COOK"
{txt}(3 real changes made)

{com}. replace q215_indnonagriworkprim_oth="LABOUR" if q215_indnonagriworkprim_oth=="LABOAR" | q215_indnonagriworkprim_oth=="LABOUR TRACTOR"
{txt}(2 real changes made)

{com}. replace q215_indnonagriworkprim_oth="INHERITED PROFESSION" if q215_indnonagriworkprim_oth=="KULA VRUTTHI" | q215_indnonagriworkprim_oth=="KULAVRUTTHI"
{txt}(2 real changes made)

{com}. replace q215_indnonagriworkprim_oth="MECHANIC" if q215_indnonagriworkprim_oth=="MEKANIC" | q215_indnonagriworkprim_oth=="MOBILE MEHANIC"
{txt}(1 real change made)

{com}. replace q215_indnonagriworkprim_oth="MASON" if q215_indnonagriworkprim_oth=="VELDING" | q215_indnonagriworkprim_oth=="MESHAN" | q215_indnonagriworkprim_oth=="MESHAN WORK" | q215_indnonagriworkprim_oth=="MESHTIRI" | q215_indnonagriworkprim_oth=="MESTRI" | q215_indnonagriworkprim_oth=="ROAD WORK" | q215_indnonagriworkprim_oth=="WELDEAR" | q215_indnonagriworkprim_oth=="WELDER" | q215_indnonagriworkprim_oth=="WELDING" | q215_indnonagriworkprim_oth=="WILDER"
{txt}(11 real changes made)

{com}. replace q215_indnonagriworkprim_oth="MICRO FINANCE" if q215_indnonagriworkprim_oth=="MIGRO FIANCE"
{txt}(1 real change made)

{com}. replace q215_indnonagriworkprim_oth="NURSE" if q215_indnonagriworkprim_oth=="NURCUC"
{txt}(1 real change made)

{com}. replace q215_indnonagriworkprim_oth="PAINTER" if q215_indnonagriworkprim_oth=="PAINTINGS"
{txt}(1 real change made)

{com}. replace q215_indnonagriworkprim_oth="MILL" if q215_indnonagriworkprim_oth=="MILLU" | q215_indnonagriworkprim_oth=="RICE MEILE" | q215_indnonagriworkprim_oth=="RICE MILL" | q215_indnonagriworkprim_oth=="RICEMILL"
{txt}(5 real changes made)

{com}. replace q215_indnonagriworkprim_oth="PETROL PUMP" if q215_indnonagriworkprim_oth=="PETROL BUNK PIPE MAN" | q215_indnonagriworkprim_oth=="RB OIL"
{txt}(2 real changes made)

{com}. replace q215_indnonagriworkprim_oth="TRANSPORT" if q215_indnonagriworkprim_oth=="SCHOOL DRIVER" | q215_indnonagriworkprim_oth=="SCHOOL.VANTA" | q215_indnonagriworkprim_oth=="TRACTOR"
{txt}(3 real changes made)

{com}. replace q215_indnonagriworkprim_oth="STUDIO" if q215_indnonagriworkprim_oth=="STOTIYOO"
{txt}(1 real change made)

{com}. replace q215_indnonagriworkprim_oth="TAILORING" if q215_indnonagriworkprim_oth=="TYIORING" | q215_indnonagriworkprim_oth=="TYLORING"
{txt}(2 real changes made)

{com}. 
. replace q215_indnonagriworkprim=15 if q215_indnonagriworkprim_oth=="TRANSPORT"
{txt}(4 real changes made)

{com}. replace q215_indnonagriworkprim=22 if q215_indnonagriworkprim_oth=="MICRO FINANCE" | q215_indnonagriworkprim_oth=="ACCOUNTANT"
{txt}(2 real changes made)

{com}. replace q215_indnonagriworkprim=14 if q215_indnonagriworkprim_oth=="ELECTRICIAN"
{txt}(3 real changes made)

{com}. replace q215_indnonagriworkprim=25 if q215_indnonagriworkprim_oth=="MASON" | q215_indnonagriworkprim_oth=="MILL" | q215_indnonagriworkprim_oth=="MECHANIC"| q215_indnonagriworkprim_oth=="FACTORY"
{txt}(21 real changes made)

{com}. 
. 
. label var  q215_indnonagriworkprim "Industry - Non-Agriculture Work"
{txt}
{com}. label define industry 1 "Food Processing" 2 "Manufacturing of Textile Products" 3 "Manufacturing of Wooden Products, Furniture" 4 "Manufacturing of Paper Products, Printing, Publishing" 5 "Other Manufacturing of Industry" 6 "Agriculture" 7 "Livestock" 8 "Fisheries" 9 "Forestry" 10 "Wholesale Trade" 11 "Retail Trade" 12 "Other Business" 13 "Hotel/ Restaurants" 14 "Electricity/gas/water" 15 "Transportation" 16 "Communication" 17 "Army/Police" 18 "Science/ Education" 19 "Arts and Culture" 20 "Health care" 21 "Sport/ tourism/ retirement" 22 "Banking, finance and credit" 23 "Management and administration" 24 "Religious activities" 25 "Non-agricultural workers" 26 "Others" -222 "Not in HH Roster" -888 "Others"
{txt}
{com}. label value q215_indnonagriworkprim industry
{txt}
{com}. label var  q215_indnonagriworkprim_oth "Industry - Non-Agriculture Work - Other"
{txt}
{com}. 
. replace q216_occprim_oth="MISSING" if q216_occprim_oth=="-" | q216_occprim_oth=="0" | q216_occprim_oth=="C"
{txt}(4 real changes made)

{com}. replace q216_occprim_oth="VALID SKIP" if q216_occprim_oth=="-555"
{txt}(2018 real changes made)

{com}. replace q216_occprim_oth="100 DAY JOB" if q216_occprim_oth=="1OODAYS WORK"
{txt}(1 real change made)

{com}. replace q216_occprim_oth="TRANSPORT" if q216_occprim_oth=="AUTO DRIVER" | q216_occprim_oth=="DRIVER" | q216_occprim_oth=="SCHOOLVANTA"
{txt}(3 real changes made)

{com}. replace q216_occprim_oth="CATERING" if q216_occprim_oth=="CENTRING"
{txt}(1 real change made)

{com}. replace q216_occprim_oth="HELPER" if q216_occprim_oth=="COOKER" | q216_occprim_oth=="MAYAREGI HELPAR" | q216_occprim_oth=="SERVANT" | q216_occprim_oth=="WATAERBOY"
{txt}(4 real changes made)

{com}. replace q216_occprim_oth="CARPENTER" if q216_occprim_oth=="CORPENDOR" | q216_occprim_oth=="KARPENTER" | q216_occprim_oth=="HOUSING CUP" | q216_occprim_oth=="PARADALU"
{txt}(4 real changes made)

{com}. replace q216_occprim_oth="ELECTRICIAN" if q216_occprim_oth=="ELECTRICAL" | q216_occprim_oth=="ELECTRICIAN"
{txt}(1 real change made)

{com}. replace q216_occprim_oth="LABOUR" if q216_occprim_oth=="KULI" | q216_occprim_oth=="LABAR" | q216_occprim_oth=="LABOUR" | q216_occprim_oth=="LABOUR IN FACTORY" | q216_occprim_oth=="LEBAR"
{txt}(4 real changes made)

{com}. replace q216_occprim_oth="MASON" if q216_occprim_oth=="MASTHRI" | q216_occprim_oth=="MESHRI" | q216_occprim_oth=="ROAD WORK" | q216_occprim_oth=="WELDER" | q216_occprim_oth=="WELDING"
{txt}(8 real changes made)

{com}. replace q216_occprim_oth="PAINTING" if q216_occprim_oth=="PAINTINGS"
{txt}(1 real change made)

{com}. replace q216_occprim_oth="PETROL PUMP" if q216_occprim_oth=="PETROL BUNK PIPE MAN"
{txt}(1 real change made)

{com}. replace q216_occprim_oth="STUDIO" if q216_occprim_oth=="STODIYO"
{txt}(1 real change made)

{com}. replace q216_occprim_oth="TAILORING" if q216_occprim_oth=="TAYLORING"
{txt}(1 real change made)

{com}. replace q216_occprim=29 if q216_occprim_oth=="CARPENTER"
{txt}(4 real changes made)

{com}. replace q216_occprim=61 if q216_occprim_oth=="MASON"
{txt}(9 real changes made)

{com}. replace q216_occprim=62 if q216_occprim_oth=="HELPER"
{txt}(8 real changes made)

{com}. replace q216_occprim=63 if q216_occprim_oth=="CONSTRUCTION"
{txt}(0 real changes made)

{com}. replace q216_occprim=55 if q216_occprim_oth=="TRANSPORT"
{txt}(3 real changes made)

{com}. replace q216_occprim=30 if q216_occprim_oth=="LABOUR"
{txt}(5 real changes made)

{com}. 
. label var  q216_occprim "Primary Occupation"
{txt}
{com}. label var  q216_occprim_oth "Primary Occupation - Other"
{txt}
{com}. label var q217_avdaiwag "Average Daily Wage"
{txt}
{com}. label var q217_avdaiwag_outlier "Is 'Average Daily Wage' an outlier?"
{txt}
{com}. label var  q218_1_relempl "Relationship to Employer"
{txt}
{com}. label define relationship 1 "Immediate family" 2 "Same sub-caste" 3 "Same caste" 4 "Friend" 5 "No Relation" -666 "NA" -777 "Refuse" -888 "Others" -999 "Don't Know" -333 "Missing" -555 "Valid Skip"
{txt}
{com}. label value q218_1_relempl relationship
{txt}
{com}. label var  q218_1_relempl_oth "Relationship to Employer - Other"
{txt}
{com}. 
. #delimit ;
{txt}delimiter now ;
{com}. label define occupation 1 "Agricultural work on own farm" 2 "Supervisory work on agricultural activity on own farm" 3 "Share cropper / cultivate plot owned by others" 4 "Agricultural wage labor" 11 "Fisherman (Fishing)" 12 "Fish culture"
> 13 "Look after live stocks" 14 "Look after Poultry (Duck, Chicken,Pigeons)" 15 "Cultivation and other works on fruits" 16 "Agricultural wage labor (Off Farm)" 17 "Nursery/forestry" 18 "Other agricultural activities (excluding 11-17)"
> 21 "Processing of crops" 22 "Family labor in Enterprise" 23 "Family labor in Tailoring" 24 "Family labor in Sewing" 25 "Family labor in Pottery" 26 "Family labor in Blacksmith" 27 "Family labor in Goldsmith" 28 "Repairing of manufactured products/mechanics" 29 "Carpenter" 30 "Non-agri. wage labor" 
> 41 "Petty Trade (Small retail shop)" 42 "Medium Trader (Retail and insignificant wholesale)" 43 "Wholesale Trader" 44 "Contractor" 45 "Labor supplier" 51 "Rickshaw/ Van Pulling"
> 52 "Boat man" 53 "Wage labor in transport" 54 "Other transport workers" 55 "Driver (motorized vehicle)" 56 "Helper" 61 "Mason" 62 "Helper" 63 "Other construction worker"
> 64 "Earthen work" 65 "House Repairing (fixing)" 71 "Doctor" 73 "Advocate" 74 "Barber" 75 "Washerman" 76 "Full time house tutor" 77 "Imam/ Purohit" 79 "Kutir Shilpi (Handicrafts)"
> 81 "Others self employment" 82 "Service ( govt/employee)" 83 "Pension" 84 "Service worker in NGO" 85 "Servant in house (Maid/ Male)" 89 "Beggar";
{txt}
{com}. #delimit cr
{txt}delimiter now cr
{com}. 
. label value q216_occprim occupation
{txt}
{com}. 
. tempfile SecB2
{txt}
{com}. save `SecB2'
{txt}file C:\Users\SLee\AppData\Local\Temp\ST_06000002.tmp saved

{com}. 
. // Merge q201 with B1
. use `Id_q213', clear
{txt}
{com}. merge 1:m Id using `SecB2', keep(3) nogen
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}               0
{txt}{col 5}matched{col 30}{res}           2,080{txt}  
{col 5}{hline 41}

{com}. 
. /****************************************************************
>         SECTION X: Save and Exit
> ****************************************************************/
. 
. compress
  {txt}q217_avdaiwag was {res}long{txt} now {res}int
  {txt}q216_occprim_oth was {res}str20{txt} now {res}str15
{txt}  (14,560 bytes saved)

{com}. save "${c -(}builddta{c )-}/followup_2014/SectionB2_NonAgri_WageIncome_cleaned.dta", replace
{txt}file C:/Users/SLee/Dropbox/Rainfall insurance India - Round 2/Data Analysis/build/output/datasets/followup_2014/SectionB2_NonAgri_WageIncome_cleaned.dta saved

{com}. 
. cap file close _all
{txt}
{com}. cap log close
{smcl}
{com}{sf}{ul off}