{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}C:/Users/SLee/Dropbox/Rainfall insurance India - Round 2/Data Analysis/build/logs/SectionM1_LeanPeriod_clean.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}12 Apr 2016, 18:34:52
{txt}
{com}. 
. 
. /****************************************************************
>         SECTION 1: Import & Clean Data                                                                                                  
> ****************************************************************/
. 
. // Master Data
. use "${c -(}builddta{c )-}/followup_2014/MasterData_cleaned.dta", clear
{txt}
{com}. 
. keep Id q218_2_mwl q218_3_mwl q218_3_oth_mwl
{txt}
{com}. order Id q218_2_mwl q218_3_mwl q218_3_oth_mwl
{txt}
{com}. * keep if (q218_2_mwl==1) // Only those who answered "Yes" answered the rest of M2 section.
. tempfile q218_part1
{txt}
{com}. save `q218_part1'
{txt}file C:\Users\SLee\AppData\Local\Temp\ST_01000001.tmp saved

{com}. 
. // M2A - Migration Wage labor, Part 1 (q213, q219)
. use "${c -(}followup_data{c )-}/AP Raw/SectionM2A_1.dta", clear
{txt}
{com}. append using "${c -(}followup_data{c )-}/TN Raw/SectionM2A_1.dta" 
{txt}
{com}. append using "${c -(}followup_data{c )-}/UP Raw/SectionM2A_1.dta" 
{txt}{p 0 7 2}
(note: variable
q213_2_bhhid was 
str4, now str30 to accommodate using data's values)
{p_end}

{com}. isid Id subid
{txt}
{com}. 
. /// Destring & recode variables
> destring *, replace
{txt}Id contains nonnumeric characters; no {res}replace
{txt}subid has all characters numeric; {res}replaced {txt}as {res}byte
{txt}q213_2_bhhid contains nonnumeric characters; no {res}replace
{txt}q213_3_hhrid contains nonnumeric characters; no {res}replace
{txt}q219_migserwork has all characters numeric; {res}replaced {txt}as {res}byte
{txt}q219_1_timesmig has all characters numeric; {res}replaced {txt}as {res}int
{txt}
{com}. ds, has(type numeric)
{txt}{col 1}subid{col 15}q219_migse~k{col 29}q219_1_tim~g

{com}. local num_var `r(varlist)'
{txt}
{com}. foreach var of local num_var {c -(}
{txt}  2{com}.         qui replace `var'=.b if mi(`var') // Blank response (but not a valid response)
{txt}  3{com}.         qui recode `var' (-999=.d) (-777=.r) (-666=.n) (-333=.b) (-555=.) // -999 "Don't Know" -888 "Others" -777 "Refuse" -666 "N/A" -333 "Missing" -555 "Valid Skip"
{txt}  4{com}.         if ("`var'" == "q224_destearning") {c -(}
{txt}  5{com}.                 qui recode `var' (-222=.n)
{txt}  6{com}.         {c )-}
{txt}  7{com}. {c )-}
{txt}
{com}. *
. 
. // Label variables
. label define yesno 1 "Yes" 2 "No"
{txt}
{com}. 
. label var Id "Household ID"
{txt}
{com}. label var subid "SubId"
{txt}
{com}. label var q213_2_bhhid "Baseline HH Roster ID"
{txt}
{com}. label var q213_3_hhrid "Current HH Roster ID"
{txt}
{com}. label var q219_migserwork "Migrate in search of work?"
{txt}
{com}. label value q219_migserwork yesno
{txt}
{com}. 
. // q219_1_timesmig
. /// Oringal question asks "how many times migrated b/w April to June, but lean period is actually from April to July in AP and UP, and from June to Sep in TN"
> /// I (SL) do not know whether households answered this question based on the period from April to June, or based on actual lean period.
> /// Final questionnaire might clarified this issue. India field team said they have final questionnaire in SQL format, but they did not share with us (Mushfiq team).
> label var q219_1_timesmig "How many times migrated during lean period?"
{txt}
{com}. note q219_1_timesmig: Lean period is from April to July in UP and AP, and from June to September in TN
{res}{txt}
{com}. 
. tempfile SecM2A_1
{txt}
{com}. save `SecM2A_1'
{txt}file C:\Users\SLee\AppData\Local\Temp\ST_01000002.tmp saved

{com}. 
. 
. // M2A, Part 2
. use "${c -(}followup_data{c )-}/AP Raw/SectionM2A1_1.dta", clear
{txt}
{com}. append using "${c -(}followup_data{c )-}/TN Raw/SectionM2A1_1.dta" 
{txt}
{com}. append using "${c -(}followup_data{c )-}/UP Raw/SectionM2A1_1.dta" 
{txt}
{com}. isid Id subid q213_4_migepisode
{txt}
{com}. 
. /// Destring and recode variables
> destring *, replace
{txt}Id contains nonnumeric characters; no {res}replace
{txt}subid has all characters numeric; {res}replaced {txt}as {res}byte
{txt}q213_4_migepisode has all characters numeric; {res}replaced {txt}as {res}int
{txt}q220_1_migweek has all characters numeric; {res}replaced {txt}as {res}int
{txt}q220_1_migmonth has all characters numeric; {res}replaced {txt}as {res}int
{txt}q222_1_days has all characters numeric; {res}replaced {txt}as {res}int
{txt}q222_2_prireason has all characters numeric; {res}replaced {txt}as {res}int
{txt}q222_2_prireason_oth contains nonnumeric characters; no {res}replace
{txt}q12_costoftravel has all characters numeric; {res}replaced {txt}as {res}long
{txt}q13_otrcostmig has all characters numeric; {res}replaced {txt}as {res}long
{txt}q14_daytoreach1 has all characters numeric; {res}replaced {txt}as {res}int
{txt}q19_payforcost has all characters numeric; {res}replaced {txt}as {res}int
{txt}q19_payforcost_oth contains nonnumeric characters; no {res}replace
{txt}q20_daytotakejob has all characters numeric; {res}replaced {txt}as {res}int
{txt}q21_costfoodlodge has all characters numeric; {res}replaced {txt}as {res}long
{txt}q21_1_savingonreturn has all characters numeric; {res}replaced {txt}as {res}long
{txt}
{com}. ds, has(type numeric)
{txt}{col 1}subid{col 15}q220_1_mig~h{col 29}q12_costof~l{col 43}q19_payfor~t{col 57}q21_1_savi~n
{col 1}q213_4_mig~e{col 15}q222_1_days{col 29}q13_otrcos~g{col 43}q20_daytot~b
{col 1}q220_1_mig~k{col 15}q222_2_pri~n{col 29}q14_daytor~1{col 43}q21_costfo~e

{com}. local num_var `r(varlist)'
{txt}
{com}. foreach var of local num_var {c -(}
{txt}  2{com}.         qui replace `var'=.b if mi(`var') // Blank response (but not a valid response)
{txt}  3{com}.         qui recode `var' (-999=.d) (-777=.r) (-666=.n) (-333=.b) (-555=.) // -999 "Don't Know" -888 "Others" -777 "Refuse" -666 "N/A" -333 "Missing" -555 "Valid Skip"
{txt}  4{com}.         if ("`var'" == "q224_destearning") {c -(}
{txt}  5{com}.                 qui recode `var' (-222=.n)
{txt}  6{com}.         {c )-}
{txt}  7{com}. {c )-}
{txt}
{com}. *
. 
. /// Clean variables
> 
. /// subid
> /// Id=="00A22" has only subid==2 in part 1, while only subide==1 in part 2. Need to match this number.
> replace subid=2 if (Id=="00A22")
{txt}(3 real changes made)

{com}. 
. //// q220_1_migweek
> //// Couple of observations have values greater than 5. 
> replace q220_1_migweek=.m if !mi(q220_1_migweek) & !inrange(q220_1_migweek,1,5) // ".m" indicates "Failure to follow direction"
{txt}(3 real changes made, 3 to missing)

{com}. 
. /// Label variables
> label define yesno 1 "Yes" 2 "No"
{txt}
{com}. 
. label var Id "Household ID"
{txt}
{com}. label var subid "SubId"
{txt}
{com}. label var q213_4_migepisode "Migration Episode SL number"
{txt}
{com}. label var q220_1_migweek "Migration - Week"
{txt}
{com}. label var q220_1_migmonth "Migration - Month"
{txt}
{com}. label var q222_1_days "Days out in migration episode"
{txt}
{com}. label var q222_2_prireason "Primary reason for migration"
{txt}
{com}. label var q222_2_prireason_oth "Primary reason for migration - Other"
{txt}
{com}. label var q12_costoftravel "Cost of travel" 
{txt}
{com}. label var q13_otrcostmig "Other migration costs"
{txt}
{com}. label var q14_daytoreach1 "Travel duration - days"
{txt}
{com}. label var q19_payforcost "Pay for migration costs"
{txt}
{com}. label var q19_payforcost_oth "Pay for migration costs - Other"
{txt}
{com}. label var q20_daytotakejob "Days to get a job"
{txt}
{com}. label var q21_costfoodlodge "Cost of food and lodging"
{txt}
{com}. label var q21_1_savingonreturn "Total savings from migration episode"
{txt}
{com}. 
. //coding for reasons for migration is not defined in questionnaire
. 
. label define migcost 1 "From own/family savings" 2 "Sold land/real estate" 3 "Sold jewellery" 4 "Spouse's family (grant)" 5 "Other Relatives (grants)" ///
>         6 "Employer in destination" 7 "Credit from money lender" 8 "Credit from NGOs" 9 "Credit from Banks" 10 "Other" 11 "Cash received from NGO"  ///
>         12 "Credit/money from relatives" 13 "Money from group members"
{txt}
{com}. 
. label value q19_payforcost migcost
{txt}
{com}. 
. /// Save
> tempfile SecM2A_2
{txt}
{com}. save `SecM2A_2'
{txt}file C:\Users\SLee\AppData\Local\Temp\ST_01000003.tmp saved

{com}. 
. 
. /// Merge Part 1 and Part 2
> use `SecM2A_1', clear
{txt}
{com}. merge 1:m Id subid using `SecM2A_2', gen(match_q219_q220X)
{res}{txt}{p 0 7 2}
(note: variable
Id was 
str6, now str244 to accommodate using data's values)
{p_end}

{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}              34
{txt}{col 9}from master{col 30}{res}              23{txt}  (match_q219_q220X==1)
{col 9}from using{col 30}{res}              11{txt}  (match_q219_q220X==2)

{col 5}matched{col 30}{res}             482{txt}  (match_q219_q220X==3)
{col 5}{hline 41}

{com}. label define match_q219_q220X 1 "q219 Only" 2 "q220.X Only" 3 "Both q219 and q220.X"
{txt}
{com}. label value match_q219_q220X match_q219_q220X
{txt}
{com}. label var match_q219_q220X "Does this household member have a complete answer for Section M2A?"
{txt}
{com}. note match_q219_q220X:  In the raw data, section M2A is separated into two different datasets (SectionM2A_1 (q219), SectionM2A1_1 (q220.X)).
{res}{txt}
{com}. note match_q219_q220X:  Not existing in both data at the same time does not necessarily mean that a respondent made mistake. ///
>                                                 For those who answered "No" in q219, they should skip the rest of Section M2A, thus should not exist in q220.x data
{res}{txt}
{com}.                                                 
. 
. gen valid_lean_migration_sample = 2 // Indicator variable - did this household member answer question properly?
{txt}
{com}. replace valid_lean_migration_sample = 1 if (q219_migserwork == 1 & match_q219_q220X == 3) // Those who answered "Yes" in q219 should also answer the rest of M2A section
{txt}(474 real changes made)

{com}. replace valid_lean_migration_sample = 1 if (q219_migserwork == 2 & match_q219_q220X == 1) // Those who answered "No" in q219 should skip the rest of section M2A
{txt}(5 real changes made)

{com}. label var valid_lean_migration_sample "Is this lean-season migration observation valid? (i.e. answered questions properly?)"
{txt}note: label truncated to 80 characters

{com}. label value valid_lean_migration_sample yesno
{txt}
{com}. 
. 
. tempfile SecM2A
{txt}
{com}. save `SecM2A'
{txt}file C:\Users\SLee\AppData\Local\Temp\ST_01000004.tmp saved

{com}. 
. 
. 
. ************* Section M2B: Migration Remittance data is missing. (Dataset in Dropbox does NOT match with questionnaire) Need to ask India team *****************
. 
. /*
> // Section M2B
> use "${c -(}followup_data{c )-}/AP Raw/XXX.dta", clear
> append using "${c -(}followup_data{c )-}/TN Raw/XXX.dta" 
> append using "${c -(}followup_data{c )-}/UP Raw/XXX.dta" 
> 
> 
> 
> /// Merge q218 with M2A
> use `q218_part1', clear
> merge 1:m Id using `SecM2A'
> 
> */
. ************* Section M2B: Migration Remittance data is missing. (Dataset in Dropbox does NOT match with questionnaire) Need to ask India team *****************
. 
. 
. /****************************************************************
>         SECTION X: Save and Exit
> ****************************************************************/
. 
. compress
  {txt}q219_1_timesmig was {res}int{txt} now {res}byte
  {txt}q213_4_migepisode was {res}int{txt} now {res}byte
  {txt}q220_1_migweek was {res}int{txt} now {res}byte
  {txt}q220_1_migmonth was {res}int{txt} now {res}byte
  {txt}q14_daytoreach1 was {res}int{txt} now {res}byte
  {txt}q20_daytotakejob was {res}int{txt} now {res}byte
  {txt}valid_lean_migration_sample was {res}float{txt} now {res}byte
  {txt}Id was {res}str244{txt} now {res}str6
  {txt}q222_2_prireason_oth was {res}str244{txt} now {res}str22
  {txt}q19_payforcost_oth was {res}str244{txt} now {res}str7
{txt}  (364,296 bytes saved)

{com}. save "${c -(}builddta{c )-}/followup_2014/SectionM2_Migration_LeanPeriod_cleaned.dta", replace
{txt}file C:/Users/SLee/Dropbox/Rainfall insurance India - Round 2/Data Analysis/build/output/datasets/followup_2014/SectionM2_Migration_LeanPeriod_cleaned.dta saved

{com}. 
. cap file close _all
{txt}
{com}. cap log close
{smcl}
{com}{sf}{ul off}