{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}C:/Users/ftac2/Dropbox/Rainfall insurance India - Round 2/Data Analysis/build/logs/SectionK_Govenrment_Schemes_clean.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}23 Jun 2016, 10:13:42
{txt}
{com}. 
. 
. /****************************************************************
>         SECTION 1: Import Raw Data                                                                                                      
> ****************************************************************/
. 
. 
. // Master Data
. use "${c -(}builddta{c )-}/followup_2014/MasterData_cleaned.dta", clear
{txt}
{com}. 
. /// Keep ID and Section J1
> keep Id q1001_nregkha11-q1015_oth_reanotrecsche_12
{txt}
{com}. rename q103* q1013*
{res}{txt}
{com}. order *, alphabetic
{txt}
{com}. 
. /// Correct errors
> ds, has(type string)
{txt}{col 1}Id{col 15}q1007_1_re~2{col 29}q1008_subp~3{col 43}q1012_h~h_12{col 57}q1015_oth~10{col 71}q1015_oth~_2{col 85}q1015_oth_~5{col 99}q1015_oth_~8
{col 1}q1004_1_o~11{col 15}q1007_1_re~3{col 29}q1011_1_o~11{col 43}q1014_amtv~4{col 57}q1015_oth~11{col 71}q1015_oth_~3{col 85}q1015_oth_~6{col 99}q1015_oth_~9
{col 1}q1006_re~h_8{col 15}q1008_subp~2{col 29}q1012_h~h_11{col 43}q1015_oth~_1{col 57}q1015_oth~12{col 71}q1015_oth_~4{col 85}q1015_oth_~7

{com}. local str_var `r(varlist)'
{txt}
{com}. foreach var of local str_var {c -(}
{txt}  2{com}.         qui replace `var'=subinstr(`var',":",".",.)
{txt}  3{com}.         qui replace `var'="" if (`var'=="-")
{txt}  4{com}. {c )-}
{txt}
{com}. *
. /*
> replace q1007_1_recitemnumunit_2="-333" if (q1007_1_recitemnumunit_2=="1:50")
> replace q1007_1_recitemnumunit_3="-333" if regexm(q1007_1_recitemnumunit_3,"0:5")
> */
. 
. /// Destring and recode variables
> destring *, replace
{txt}Id contains nonnumeric bytes; no {res}replace
{txt}q1001_nregkha11 already numeric; no {res}replace
{txt}q1002_totdayHHnreg11 already numeric; no {res}replace
{txt}q1003_totvalHHnreg11 already numeric; no {res}replace
{txt}q1004_1_othnotusenreg11 contains nonnumeric bytes; no {res}replace
{txt}q1004_notusenreg11 already numeric; no {res}replace
{txt}q1005_usepdskha11 already numeric; no {res}replace
{txt}q1006_recitemkha11_1 already numeric; no {res}replace
{txt}q1006_recitemkha11_2 already numeric; no {res}replace
{txt}q1006_recitemkha11_3 already numeric; no {res}replace
{txt}q1006_recitemkha11_4 already numeric; no {res}replace
{txt}q1006_recitemkha11_5 already numeric; no {res}replace
{txt}q1006_recitemkha11_6 already numeric; no {res}replace
{txt}q1006_recitemkha11_7 already numeric; no {res}replace
{txt}q1006_recitemkha11_8 already numeric; no {res}replace
{txt}q1006_recitemkha11_oth_8 contains nonnumeric bytes; no {res}replace
{txt}q1007_1_recitemnumunit_1 already numeric; no {res}replace
{txt}q1007_1_recitemnumunit_2 has all characters numeric; {res}replaced {txt}as {res}double
{txt}(64 missing values generated)
{res}{txt}q1007_1_recitemnumunit_3 has all characters numeric; {res}replaced {txt}as {res}double
{txt}(64 missing values generated)
{res}{txt}q1007_1_recitemnumunit_4 already numeric; no {res}replace
{txt}q1007_1_recitemnumunit_5 already numeric; no {res}replace
{txt}q1007_1_recitemnumunit_6 already numeric; no {res}replace
{txt}q1007_1_recitemnumunit_7 already numeric; no {res}replace
{txt}q1007_1_recitemnumunit_8 already numeric; no {res}replace
{txt}q1007_recitemunitmon_1 already numeric; no {res}replace
{txt}q1007_recitemunitmon_2 already numeric; no {res}replace
{txt}q1007_recitemunitmon_3 already numeric; no {res}replace
{txt}q1007_recitemunitmon_4 already numeric; no {res}replace
{txt}q1007_recitemunitmon_5 already numeric; no {res}replace
{txt}q1007_recitemunitmon_6 already numeric; no {res}replace
{txt}q1007_recitemunitmon_7 already numeric; no {res}replace
{txt}q1007_recitemunitmon_8 already numeric; no {res}replace
{txt}q1008_subpricperunit_1 already numeric; no {res}replace
{txt}q1008_subpricperunit_2 has all characters numeric; {res}replaced {txt}as {res}double
{txt}(64 missing values generated)
{res}{txt}q1008_subpricperunit_3 has all characters numeric; {res}replaced {txt}as {res}double
{txt}(64 missing values generated)
{res}{txt}q1008_subpricperunit_4 already numeric; no {res}replace
{txt}q1008_subpricperunit_5 already numeric; no {res}replace
{txt}q1008_subpricperunit_6 already numeric; no {res}replace
{txt}q1008_subpricperunit_7 already numeric; no {res}replace
{txt}q1008_subpricperunit_8 already numeric; no {res}replace
{txt}q1009_avemarkpricpunit_1 already numeric; no {res}replace
{txt}q1009_avemarkpricpunit_2 already numeric; no {res}replace
{txt}q1009_avemarkpricpunit_3 already numeric; no {res}replace
{txt}q1009_avemarkpricpunit_4 already numeric; no {res}replace
{txt}q1009_avemarkpricpunit_5 already numeric; no {res}replace
{txt}q1009_avemarkpricpunit_6 already numeric; no {res}replace
{txt}q1009_avemarkpricpunit_7 already numeric; no {res}replace
{txt}q1009_avemarkpricpunit_8 already numeric; no {res}replace
{txt}q1010_nummonpdskha11_1 already numeric; no {res}replace
{txt}q1010_nummonpdskha11_2 already numeric; no {res}replace
{txt}q1010_nummonpdskha11_3 already numeric; no {res}replace
{txt}q1010_nummonpdskha11_4 already numeric; no {res}replace
{txt}q1010_nummonpdskha11_5 already numeric; no {res}replace
{txt}q1010_nummonpdskha11_6 already numeric; no {res}replace
{txt}q1010_nummonpdskha11_7 already numeric; no {res}replace
{txt}q1010_nummonpdskha11_8 already numeric; no {res}replace
{txt}q1011_1_othreanotusepds11 contains nonnumeric bytes; no {res}replace
{txt}q1011_reanotusepds11 already numeric; no {res}replace
{txt}q1012_heardnameprog_1 already numeric; no {res}replace
{txt}q1012_heardnameprog_10 already numeric; no {res}replace
{txt}q1012_heardnameprog_11 already numeric; no {res}replace
{txt}q1012_heardnameprog_12 already numeric; no {res}replace
{txt}q1012_heardnameprog_2 already numeric; no {res}replace
{txt}q1012_heardnameprog_3 already numeric; no {res}replace
{txt}q1012_heardnameprog_4 already numeric; no {res}replace
{txt}q1012_heardnameprog_5 already numeric; no {res}replace
{txt}q1012_heardnameprog_6 already numeric; no {res}replace
{txt}q1012_heardnameprog_7 already numeric; no {res}replace
{txt}q1012_heardnameprog_8 already numeric; no {res}replace
{txt}q1012_heardnameprog_9 already numeric; no {res}replace
{txt}q1012_heardnameprog_oth_11 contains nonnumeric bytes; no {res}replace
{txt}q1012_heardnameprog_oth_12 contains nonnumeric bytes; no {res}replace
{txt}q1013_usedschememay11_1 already numeric; no {res}replace
{txt}q1013_usedschememay11_10 already numeric; no {res}replace
{txt}q1013_usedschememay11_11 already numeric; no {res}replace
{txt}q1013_usedschememay11_12 already numeric; no {res}replace
{txt}q1013_usedschememay11_2 already numeric; no {res}replace
{txt}q1013_usedschememay11_3 already numeric; no {res}replace
{txt}q1013_usedschememay11_4 already numeric; no {res}replace
{txt}q1013_usedschememay11_5 already numeric; no {res}replace
{txt}q1013_usedschememay11_6 already numeric; no {res}replace
{txt}q1013_usedschememay11_7 already numeric; no {res}replace
{txt}q1013_usedschememay11_8 already numeric; no {res}replace
{txt}q1013_usedschememay11_9 already numeric; no {res}replace
{txt}q1014_amtvalrec_1 already numeric; no {res}replace
{txt}q1014_amtvalrec_10 already numeric; no {res}replace
{txt}q1014_amtvalrec_11 already numeric; no {res}replace
{txt}q1014_amtvalrec_12 already numeric; no {res}replace
{txt}q1014_amtvalrec_2 already numeric; no {res}replace
{txt}q1014_amtvalrec_3 already numeric; no {res}replace
{txt}q1014_amtvalrec_4 has all characters numeric; {res}replaced {txt}as {res}int
{txt}(63 missing values generated)
{res}{txt}q1014_amtvalrec_5 already numeric; no {res}replace
{txt}q1014_amtvalrec_6 already numeric; no {res}replace
{txt}q1014_amtvalrec_7 already numeric; no {res}replace
{txt}q1014_amtvalrec_8 already numeric; no {res}replace
{txt}q1014_amtvalrec_9 already numeric; no {res}replace
{txt}q1015_oth_reanotrecsche_1 contains nonnumeric bytes; no {res}replace
{txt}q1015_oth_reanotrecsche_10 contains nonnumeric bytes; no {res}replace
{txt}q1015_oth_reanotrecsche_11 contains nonnumeric bytes; no {res}replace
{txt}q1015_oth_reanotrecsche_12 contains nonnumeric bytes; no {res}replace
{txt}q1015_oth_reanotrecsche_2 contains nonnumeric bytes; no {res}replace
{txt}q1015_oth_reanotrecsche_3 contains nonnumeric bytes; no {res}replace
{txt}q1015_oth_reanotrecsche_4 contains nonnumeric bytes; no {res}replace
{txt}q1015_oth_reanotrecsche_5 contains nonnumeric bytes; no {res}replace
{txt}q1015_oth_reanotrecsche_6 contains nonnumeric bytes; no {res}replace
{txt}q1015_oth_reanotrecsche_7 contains nonnumeric bytes; no {res}replace
{txt}q1015_oth_reanotrecsche_8 contains nonnumeric bytes; no {res}replace
{txt}q1015_oth_reanotrecsche_9 contains nonnumeric bytes; no {res}replace
{txt}q1015_reanotrecsche_1 already numeric; no {res}replace
{txt}q1015_reanotrecsche_10 already numeric; no {res}replace
{txt}q1015_reanotrecsche_11 already numeric; no {res}replace
{txt}q1015_reanotrecsche_12 already numeric; no {res}replace
{txt}q1015_reanotrecsche_2 already numeric; no {res}replace
{txt}q1015_reanotrecsche_3 already numeric; no {res}replace
{txt}q1015_reanotrecsche_4 already numeric; no {res}replace
{txt}q1015_reanotrecsche_5 already numeric; no {res}replace
{txt}q1015_reanotrecsche_6 already numeric; no {res}replace
{txt}q1015_reanotrecsche_7 already numeric; no {res}replace
{txt}q1015_reanotrecsche_8 already numeric; no {res}replace
{txt}q1015_reanotrecsche_9 already numeric; no {res}replace
{txt}
{com}. ds, has(type numeric)
{txt}{col 1}q1001_nre~11{col 15}q1007_1_re~1{col 29}q1007_reci~6{col 43}q1009_avem~3{col 57}q1010_numm~8{col 71}q1012_hear~9{col 85}q1014_amt~_1{col 99}q1015_rea~10
{col 1}q1002_tot~11{col 15}q1007_1_re~2{col 29}q1007_reci~7{col 43}q1009_avem~4{col 57}q1011_rea~11{col 71}q1013_use~_1{col 85}q1014_amt~10{col 99}q1015_rea~11
{col 1}q1003_tot~11{col 15}q1007_1_re~3{col 29}q1007_reci~8{col 43}q1009_avem~5{col 57}q1012_hea~_1{col 71}q1013_use~10{col 85}q1014_amt~11{col 99}q1015_rea~12
{col 1}q1004_not~11{col 15}q1007_1_re~4{col 29}q1008_subp~1{col 43}q1009_avem~6{col 57}q1012_hea~10{col 71}q1013_use~11{col 85}q1014_amt~12{col 99}q1015_rea~_2
{col 1}q1005_use~11{col 15}q1007_1_re~5{col 29}q1008_subp~2{col 43}q1009_avem~7{col 57}q1012_h~g_11{col 71}q1013_use~12{col 85}q1014_amt~_2{col 99}q1015_rean~3
{col 1}q1006_reci~1{col 15}q1007_1_re~6{col 29}q1008_subp~3{col 43}q1009_avem~8{col 57}q1012_h~g_12{col 71}q1013_use~_2{col 85}q1014_amtv~3{col 99}q1015_rean~4
{col 1}q1006_reci~2{col 15}q1007_1_re~7{col 29}q1008_subp~4{col 43}q1010_numm~1{col 57}q1012_hea~_2{col 71}q1013_used~3{col 85}q1014_amtv~4{col 99}q1015_rean~5
{col 1}q1006_reci~3{col 15}q1007_1_re~8{col 29}q1008_subp~5{col 43}q1010_numm~2{col 57}q1012_hear~3{col 71}q1013_used~4{col 85}q1014_amtv~5{col 99}q1015_rean~6
{col 1}q1006_reci~4{col 15}q1007_reci~1{col 29}q1008_subp~6{col 43}q1010_numm~3{col 57}q1012_hear~4{col 71}q1013_used~5{col 85}q1014_amtv~6{col 99}q1015_rean~7
{col 1}q1006_reci~5{col 15}q1007_reci~2{col 29}q1008_subp~7{col 43}q1010_numm~4{col 57}q1012_hear~5{col 71}q1013_used~6{col 85}q1014_amtv~7{col 99}q1015_rean~8
{col 1}q1006_reci~6{col 15}q1007_reci~3{col 29}q1008_subp~8{col 43}q1010_numm~5{col 57}q1012_hear~6{col 71}q1013_used~7{col 85}q1014_amtv~8{col 99}q1015_rean~9
{col 1}q1006_reci~7{col 15}q1007_reci~4{col 29}q1009_avem~1{col 43}q1010_numm~6{col 57}q1012_hear~7{col 71}q1013_used~8{col 85}q1014_amtv~9
{col 1}q1006_re~1_8{col 15}q1007_reci~5{col 29}q1009_avem~2{col 43}q1010_numm~7{col 57}q1012_hear~8{col 71}q1013_used~9{col 85}q1015_rea~_1

{com}. local num_var `r(varlist)'
{txt}
{com}. foreach var of local num_var {c -(}
{txt}  2{com}.         qui replace `var'=.b if mi(`var') // Blank response (but not a valid response)
{txt}  3{com}.         qui recode `var' (-999=.d) (-777=.r) (-666=.n) (-333=.b) (-555=.) // -999 "Don't Know" -888 "Others" -777 "Refuse" -666 "N/A" -333 "Missing" -555 "Valid Skip"
{txt}  4{com}. {c )-}
{txt}
{com}. *
. 
. // Logic check (Skip pattern)
. 
. /// q1001~q1003
> replace q1002_totdayHHnreg11=.m if ((q1001_nregkha11!=1) & !mi(q1002_totdayHHnreg11))
{txt}(12 real changes made, 12 to missing)

{com}. replace q1003_totvalHHnreg11=.m if ((q1001_nregkha11!=1) & !mi(q1003_totvalHHnreg11))
{txt}(5 real changes made, 5 to missing)

{com}. 
. /// q1006 ~ q1010
> ds q1006_recitemkha11_1-q1010_nummonpdskha11_8
{txt}{col 1}q1006_reci~1{col 15}q1006_re~1_8{col 29}q1007_1_re~6{col 43}q1007_reci~5{col 57}q1008_subp~4{col 71}q1009_avem~3{col 85}q1010_numm~2
{col 1}q1006_reci~2{col 15}q1006_re~h_8{col 29}q1007_1_re~7{col 43}q1007_reci~6{col 57}q1008_subp~5{col 71}q1009_avem~4{col 85}q1010_numm~3
{col 1}q1006_reci~3{col 15}q1007_1_re~1{col 29}q1007_1_re~8{col 43}q1007_reci~7{col 57}q1008_subp~6{col 71}q1009_avem~5{col 85}q1010_numm~4
{col 1}q1006_reci~4{col 15}q1007_1_re~2{col 29}q1007_reci~1{col 43}q1007_reci~8{col 57}q1008_subp~7{col 71}q1009_avem~6{col 85}q1010_numm~5
{col 1}q1006_reci~5{col 15}q1007_1_re~3{col 29}q1007_reci~2{col 43}q1008_subp~1{col 57}q1008_subp~8{col 71}q1009_avem~7{col 85}q1010_numm~6
{col 1}q1006_reci~6{col 15}q1007_1_re~4{col 29}q1007_reci~3{col 43}q1008_subp~2{col 57}q1009_avem~1{col 71}q1009_avem~8{col 85}q1010_numm~7
{col 1}q1006_reci~7{col 15}q1007_1_re~5{col 29}q1007_reci~4{col 43}q1008_subp~3{col 57}q1009_avem~2{col 71}q1010_numm~1{col 85}q1010_numm~8

{com}. loc PDSvar `r(varlist)'
{txt}
{com}. foreach var of local PDSvar {c -(}
{txt}  2{com}.         if "`var'"=="q1006_recitemkha11_oth_8" {c -(}
{txt}  3{com}.                 continue
{txt}  4{com}.         {c )-}
{txt}  5{com}.         replace `var'=.m if ((q1005_usepdskha11!=1) & !mi(`var'))
{txt}  6{com}. {c )-}
{txt}(4 real changes made, 4 to missing)
(4 real changes made, 4 to missing)
(4 real changes made, 4 to missing)
(4 real changes made, 4 to missing)
(4 real changes made, 4 to missing)
(4 real changes made, 4 to missing)
(4 real changes made, 4 to missing)
(4 real changes made, 4 to missing)
(2 real changes made, 2 to missing)
(2 real changes made, 2 to missing)
(2 real changes made, 2 to missing)
(2 real changes made, 2 to missing)
(2 real changes made, 2 to missing)
(0 real changes made)
(0 real changes made)
(1 real change made, 1 to missing)
(2 real changes made, 2 to missing)
(2 real changes made, 2 to missing)
(2 real changes made, 2 to missing)
(2 real changes made, 2 to missing)
(2 real changes made, 2 to missing)
(0 real changes made)
(0 real changes made)
(1 real change made, 1 to missing)
(2 real changes made, 2 to missing)
(2 real changes made, 2 to missing)
(2 real changes made, 2 to missing)
(2 real changes made, 2 to missing)
(2 real changes made, 2 to missing)
(0 real changes made)
(0 real changes made)
(1 real change made, 1 to missing)
(2 real changes made, 2 to missing)
(2 real changes made, 2 to missing)
(2 real changes made, 2 to missing)
(2 real changes made, 2 to missing)
(2 real changes made, 2 to missing)
(0 real changes made)
(0 real changes made)
(1 real change made, 1 to missing)
(2 real changes made, 2 to missing)
(2 real changes made, 2 to missing)
(2 real changes made, 2 to missing)
(2 real changes made, 2 to missing)
(2 real changes made, 2 to missing)
(0 real changes made)
(0 real changes made)
(1 real change made, 1 to missing)

{com}. *
. 
. /// q1005 ~ q1010
> forval i=1/8 {c -(}
{txt}  2{com}.         replace q1007_recitemunitmon_`i'=.m if ((q1006_recitemkha11_`i'==2) & !mi(q1007_recitemunitmon_`i'))
{txt}  3{com}.         replace q1007_1_recitemnumunit_`i'=.m if ((q1006_recitemkha11_`i'==2) & !mi(q1007_1_recitemnumunit_`i'))
{txt}  4{com}.         replace q1008_subpricperunit_`i'=.m if ((q1006_recitemkha11_`i'==2) & !mi(q1008_subpricperunit_`i'))
{txt}  5{com}.         replace q1009_avemarkpricpunit_`i'=.m if ((q1006_recitemkha11_`i'==2) & !mi(q1009_avemarkpricpunit_`i'))
{txt}  6{com}.         replace q1010_nummonpdskha11_`i'=.m if ((q1006_recitemkha11_`i'==2) & !mi(q1010_nummonpdskha11_`i'))
{txt}  7{com}. {c )-}
{txt}(4 real changes made, 4 to missing)
(3 real changes made, 3 to missing)
(3 real changes made, 3 to missing)
(2 real changes made, 2 to missing)
(2 real changes made, 2 to missing)
(6 real changes made, 6 to missing)
(3 real changes made, 3 to missing)
(2 real changes made, 2 to missing)
(2 real changes made, 2 to missing)
(2 real changes made, 2 to missing)
(1 real change made, 1 to missing)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(3 real changes made, 3 to missing)
(2 real changes made, 2 to missing)
(2 real changes made, 2 to missing)
(3 real changes made, 3 to missing)
(3 real changes made, 3 to missing)
(1 real change made, 1 to missing)
(1 real change made, 1 to missing)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(3 real changes made, 3 to missing)
(1 real change made, 1 to missing)
(1 real change made, 1 to missing)
(1 real change made, 1 to missing)
(1 real change made, 1 to missing)
(5 real changes made, 5 to missing)
(4 real changes made, 4 to missing)
(4 real changes made, 4 to missing)
(4 real changes made, 4 to missing)
(4 real changes made, 4 to missing)

{com}. *
. 
. /// q1012~q1015
> forval i=1/12 {c -(}
{txt}  2{com}.         di "i is `i'"
{txt}  3{com}.         replace q1013_usedschememay11_`i'=.m if ((q1012_heardnameprog_`i'==2) & !mi(q1013_usedschememay11_`i'))
{txt}  4{com}.         replace q1014_amtvalrec_`i'=.m if ((q1012_heardnameprog_`i'==2) & !mi(q1014_amtvalrec_`i'))
{txt}  5{com}.         replace q1015_reanotrecsche_`i'=.m if ((q1012_heardnameprog_`i'==2) & !mi(q1015_reanotrecsche_`i'))
{txt}  6{com}.         replace q1015_oth_reanotrecsche_`i'="Valid Skip" if ((q1012_heardnameprog_`i'==2) & !mi(q1015_oth_reanotrecsche_`i'))
{txt}  7{com}.         
.         /// q1013,q1014
>         replace q1014_amtvalrec_`i'=.m if ((q1013_usedschememay11_`i'==2) & !mi(q1014_amtvalrec_`i'))
{txt}  8{com}. {c )-}
i is 1
{txt}(3 real changes made, 3 to missing)
(1 real change made, 1 to missing)
(1 real change made, 1 to missing)
(2,677 real changes made)
(8 real changes made, 8 to missing)
i is 2
(2 real changes made, 2 to missing)
(0 real changes made)
(4 real changes made, 4 to missing)
(1,772 real changes made)
(9 real changes made, 9 to missing)
i is 3
(0 real changes made)
(0 real changes made)
(1 real change made, 1 to missing)
(1,939 real changes made)
(1 real change made, 1 to missing)
i is 4
(3 real changes made, 3 to missing)
(2 real changes made, 2 to missing)
(2 real changes made, 2 to missing)
(2,151 real changes made)
(4 real changes made, 4 to missing)
i is 5
(5 real changes made, 5 to missing)
(1 real change made, 1 to missing)
(4 real changes made, 4 to missing)
(3,429 real changes made)
(4 real changes made, 4 to missing)
i is 6
(3 real changes made, 3 to missing)
(0 real changes made)
(2 real changes made, 2 to missing)
(3,398 real changes made)
(1 real change made, 1 to missing)
i is 7
(5 real changes made, 5 to missing)
(0 real changes made)
(4 real changes made, 4 to missing)
(3,004 real changes made)
(5 real changes made, 5 to missing)
i is 8
(4 real changes made, 4 to missing)
(0 real changes made)
(3 real changes made, 3 to missing)
(4,246 real changes made)
(1 real change made, 1 to missing)
i is 9
(2 real changes made, 2 to missing)
(0 real changes made)
(2 real changes made, 2 to missing)
(3,076 real changes made)
(1 real change made, 1 to missing)
i is 10
(2 real changes made, 2 to missing)
(1 real change made, 1 to missing)
(0 real changes made)
(1,923 real changes made)
(5 real changes made, 5 to missing)
i is 11
(2 real changes made, 2 to missing)
(0 real changes made)
(1 real change made, 1 to missing)
(4,857 real changes made)
(0 real changes made)
i is 12
(2 real changes made, 2 to missing)
(0 real changes made)
(1 real change made, 1 to missing)
(4,876 real changes made)
(0 real changes made)

{com}. *
. 
. 
. /****************************************************************
>         SECTION X: Save and Exit
> ****************************************************************/
. 
. qui compress
{txt}
{com}. save "${c -(}builddta{c )-}/followup_2014/SectionK_Govenrment_Schemes_cleaned.dta", replace
{txt}file C:/Users/ftac2/Dropbox/Rainfall insurance India - Round 2/Data Analysis/build/output/datasets/followup_2014/SectionK_Govenrment_Schemes_cleaned.dta saved

{com}. 
. cap file close _all
{txt}
{com}. cap log close
{smcl}
{com}{sf}{ul off}