{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}C:/Users/SLee/Dropbox/Rainfall insurance India - Round 2/Data Analysis/build/logs/SectionD2_CropDetails_clean.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}12 Apr 2016, 20:06:14
{txt}
{com}. 
. 
. /****************************************************************
>         SECTION 1: Import & Clean Data                                                                                                  
> ****************************************************************/
. 
. // Master Data
. use "${c -(}builddta{c )-}/followup_2014/MasterData_cleaned.dta", clear
{txt}
{com}. keep Id q324_2_CulCrops-q332_outunitmeas_oth_5 q333_1_curown_1-q338_planpurkha_23
{txt}
{com}. 
. 
. // Clean variables
. 
. /// Q324
> /// Some households answered they did not cultivate any crops listed, but they answered they did in later questions.
> replace q324_2_CulCrops=1 if inlist(Id,"P3124","P3579","P4715") // Change their answer from "No" to "Yes"
{txt}(3 real changes made)

{com}. /// One household (Id=="P3425") answered "Yes" to q324 but skipped most questions. Need to correct them.
> foreach var in q327_plancrop_1 q327_plancrop_2 q327_plancrop_3 q327_plancrop_5 {c -(}
{txt}  2{com}.         qui replace `var' =2 if (Id=="P3425")
{txt}  3{com}. {c )-}
{txt}
{com}. *
. 
. /// Destring & recode variables
> qui destring *, replace
{txt}
{com}. qui ds, has(type numeric)
{txt}
{com}. local num_var `r(varlist)'
{txt}
{com}. foreach var of local num_var {c -(}
{txt}  2{com}.         qui replace `var'=.b if mi(`var') // Blank response (but not a valid skip)
{txt}  3{com}.         qui recode `var' (-999=.d) (-777=.r) (-666=.n) (-333=.b) (-555=.) // -999 "Don't Know" -888 "Others" -777 "Refuse" -666 "N/A" -333 "Missing" -555 "Valid Skip"
{txt}  4{com}. {c )-}
{txt}
{com}. *
. label define yesno 1 "Yes" 2 "No", replace
{txt}
{com}. label value q327_plancrop_1 q327_plancrop_2 q327_plancrop_3 q327_plancrop_4 q327_plancrop_5 yesno
{txt}
{com}. 
. 
. 
. 
. /****************************************************************
>         SECTION X: Save and Exit
> ****************************************************************/
. 
. qui compress
{txt}
{com}. save "${c -(}builddta{c )-}/followup_2014/SectionD2_CropDetails_cleaned.dta", replace
{txt}file C:/Users/SLee/Dropbox/Rainfall insurance India - Round 2/Data Analysis/build/output/datasets/followup_2014/SectionD2_CropDetails_cleaned.dta saved

{com}. 
. cap file close _all
{txt}
{com}. cap log close
{smcl}
{com}{sf}{ul off}